In [ ]:
import numpy as np

In [ ]:
import pandas as pd

In [39]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
   .....:                    "data1": range(6)})

In [40]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [41]:
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [42]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [43]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [44]:
df_with_dummy = df[["data1"]].join(dummies)

In [45]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [46]:
mnames = ["movie_id", "title", "genres"]

In [47]:
mnames

['movie_id', 'title', 'genres']

In [48]:
movies = pd.read_table("datasets/movielens/movies.dat", sep="::",
   .....:                        header=None, names=mnames, engine="python")

In [49]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [50]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [51]:
dummies = movies["genres"].str.get_dummies("|")

In [52]:
dummies.iloc[:10,:6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [53]:
movies_windic = movies.join(dummies.add_prefix("Genre_"))

In [55]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [56]:
s = pd.Series([1, 2, 3, None])

In [57]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [58]:
import re

In [59]:
text = "foo    bar\t baz  \tqux"

In [60]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [61]:
text

'foo    bar\t baz  \tqux'

In [62]:
data = pd.Series(np.random.uniform(size=9),
   ....:                  index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
   ....:                         [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [64]:
data

a  1    0.787901
   2    0.251340
   3    0.637250
b  1    0.029803
   3    0.924852
c  1    0.943030
   2    0.032440
d  2    0.944584
   3    0.777303
dtype: float64

In [66]:
data["b"]

1    0.029803
3    0.924852
dtype: float64

In [67]:
data.loc[["b", "d"]]

b  1    0.029803
   3    0.924852
d  2    0.944584
   3    0.777303
dtype: float64

In [70]:
data.loc[:, 2]

a    0.251340
c    0.032440
d    0.944584
dtype: float64